-------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/maida/StataBook/log/Recoding.log
  log type:  text
 opened on:  27 Jan 2013, 23:14:28

. 
.         tab1  q1 q2 q3 q4 q6 q5 q5x1 q5x2 q6,m

-> tabulation of q1  

         q1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,044       46.64       46.64
          2 |      4,626       53.36      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q2  

         q2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          5 |         96        1.11        1.11
          6 |        228        2.63        3.74
          7 |        168        1.94        5.67
          8 |        168        1.94        7.61
          9 |        132        1.52        9.13
         10 |        168        1.94       11.07
         11 |        252        2.91       13.98
         12 |        252        2.91       16.89
         13 |        162        1.87       18.75
         14 |        252        2.91       21.66
         15 |        252        2.91       24.57
         16 |        210        2.42       26.99
         17 |        150        1.73       28.72
         18 |        282        3.25       31.97
         19 |        216        2.49       34.46
         20 |        144        1.66       36.12
         21 |        162        1.87       37.99
         22 |        192        2.21       40.21
         23 |        216        2.49       42.70
         24 |        240        2.77       45.47
         25 |        234        2.70       48.17
         26 |        264        3.04       51.21
         27 |        222        2.56       53.77
         28 |        192        2.21       55.99
         29 |        198        2.28       58.27
         30 |        192        2.21       60.48
         31 |        162        1.87       62.35
         32 |        174        2.01       64.36
         33 |        174        2.01       66.37
         34 |        162        1.87       68.24
         35 |        192        2.21       70.45
         36 |        126        1.45       71.90
         37 |        126        1.45       73.36
         38 |        150        1.73       75.09
         39 |        150        1.73       76.82
         40 |        234        2.70       79.52
         41 |        126        1.45       80.97
         42 |        144        1.66       82.63
         43 |        210        2.42       85.05
         44 |        174        2.01       87.06
         45 |        132        1.52       88.58
         46 |        102        1.18       89.76
         47 |        108        1.25       91.00
         48 |        132        1.52       92.53
         49 |        108        1.25       93.77
         50 |         36        0.42       94.19
         51 |        126        1.45       95.64
         52 |        162        1.87       97.51
         53 |         66        0.76       98.27
         54 |         90        1.04       99.31
         55 |         60        0.69      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q3  

         q3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        132        1.52        1.52
          2 |      1,704       19.65       21.18
          3 |      3,774       43.53       64.71
          4 |        882       10.17       74.88
          5 |        912       10.52       85.40
          6 |      1,170       13.49       98.89
        999 |         96        1.11      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q4  

         q4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,188       13.70       13.70
          2 |        774        8.93       22.63
          3 |        888       10.24       32.87
          4 |      1,350       15.57       48.44
          5 |      1,488       17.16       65.61
          6 |      1,332       15.36       80.97
          7 |      1,626       18.75       99.72
        999 |         24        0.28      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q6  

         q6 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         96        1.11        1.11
          2 |        264        3.04        4.15
          3 |        516        5.95       10.10
          4 |        972       11.21       21.31
          5 |      1,092       12.60       33.91
          6 |      1,998       23.04       56.96
          7 |      1,200       13.84       70.80
          8 |        846        9.76       80.55
          9 |        678        7.82       88.37
         10 |        186        2.15       90.52
         11 |         84        0.97       91.49
        999 |        738        8.51      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q5  

         q5 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,394       62.21       62.21
          2 |        150        1.73       63.94
          3 |      2,868       33.08       97.02
          4 |        228        2.63       99.65
        999 |         30        0.35      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q5x1  

       q5x1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        402        4.64        4.64
          2 |      4,284       49.41       54.05
          3 |      1,650       19.03       73.08
          4 |        132        1.52       74.60
          5 |        948       10.93       85.54
          6 |        582        6.71       92.25
          7 |         54        0.62       92.87
          8 |        222        2.56       95.43
        888 |        258        2.98       98.41
        999 |        138        1.59      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q5x2  

       q5x2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        678        7.82        7.82
          2 |      1,626       18.75       26.57
          3 |      2,088       24.08       50.66
          4 |      1,680       19.38       70.03
          5 |      1,236       14.26       84.29
          6 |        456        5.26       89.55
          7 |        468        5.40       94.95
        888 |        258        2.98       97.92
        999 |        180        2.08      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q6  

         q6 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         96        1.11        1.11
          2 |        264        3.04        4.15
          3 |        516        5.95       10.10
          4 |        972       11.21       21.31
          5 |      1,092       12.60       33.91
          6 |      1,998       23.04       56.96
          7 |      1,200       13.84       70.80
          8 |        846        9.76       80.55
          9 |        678        7.82       88.37
         10 |        186        2.15       90.52
         11 |         84        0.97       91.49
        999 |        738        8.51      100.00
------------+-----------------------------------
      Total |      8,670      100.00

. 
.         /*
>         foreach var of varlist q1 q2 q3 q4 q6 q5 q5x1 q5x2{
> 
>                 di "Recoding variable `var'" 
>                 replace `var' = . if `var' == 999
>                 replace `var' = . if `var' == 888  
>         }
>         */
. 
. 
. tab1 q1 q2 q3 q4 q6 q5 q5x1 q5x2 ,m

-> tabulation of q1  

         q1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,044       46.64       46.64
          2 |      4,626       53.36      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q2  

         q2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          5 |         96        1.11        1.11
          6 |        228        2.63        3.74
          7 |        168        1.94        5.67
          8 |        168        1.94        7.61
          9 |        132        1.52        9.13
         10 |        168        1.94       11.07
         11 |        252        2.91       13.98
         12 |        252        2.91       16.89
         13 |        162        1.87       18.75
         14 |        252        2.91       21.66
         15 |        252        2.91       24.57
         16 |        210        2.42       26.99
         17 |        150        1.73       28.72
         18 |        282        3.25       31.97
         19 |        216        2.49       34.46
         20 |        144        1.66       36.12
         21 |        162        1.87       37.99
         22 |        192        2.21       40.21
         23 |        216        2.49       42.70
         24 |        240        2.77       45.47
         25 |        234        2.70       48.17
         26 |        264        3.04       51.21
         27 |        222        2.56       53.77
         28 |        192        2.21       55.99
         29 |        198        2.28       58.27
         30 |        192        2.21       60.48
         31 |        162        1.87       62.35
         32 |        174        2.01       64.36
         33 |        174        2.01       66.37
         34 |        162        1.87       68.24
         35 |        192        2.21       70.45
         36 |        126        1.45       71.90
         37 |        126        1.45       73.36
         38 |        150        1.73       75.09
         39 |        150        1.73       76.82
         40 |        234        2.70       79.52
         41 |        126        1.45       80.97
         42 |        144        1.66       82.63
         43 |        210        2.42       85.05
         44 |        174        2.01       87.06
         45 |        132        1.52       88.58
         46 |        102        1.18       89.76
         47 |        108        1.25       91.00
         48 |        132        1.52       92.53
         49 |        108        1.25       93.77
         50 |         36        0.42       94.19
         51 |        126        1.45       95.64
         52 |        162        1.87       97.51
         53 |         66        0.76       98.27
         54 |         90        1.04       99.31
         55 |         60        0.69      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q3  

         q3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        132        1.52        1.52
          2 |      1,704       19.65       21.18
          3 |      3,774       43.53       64.71
          4 |        882       10.17       74.88
          5 |        912       10.52       85.40
          6 |      1,170       13.49       98.89
        999 |         96        1.11      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q4  

         q4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,188       13.70       13.70
          2 |        774        8.93       22.63
          3 |        888       10.24       32.87
          4 |      1,350       15.57       48.44
          5 |      1,488       17.16       65.61
          6 |      1,332       15.36       80.97
          7 |      1,626       18.75       99.72
        999 |         24        0.28      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q6  

         q6 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         96        1.11        1.11
          2 |        264        3.04        4.15
          3 |        516        5.95       10.10
          4 |        972       11.21       21.31
          5 |      1,092       12.60       33.91
          6 |      1,998       23.04       56.96
          7 |      1,200       13.84       70.80
          8 |        846        9.76       80.55
          9 |        678        7.82       88.37
         10 |        186        2.15       90.52
         11 |         84        0.97       91.49
        999 |        738        8.51      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q5  

         q5 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,394       62.21       62.21
          2 |        150        1.73       63.94
          3 |      2,868       33.08       97.02
          4 |        228        2.63       99.65
        999 |         30        0.35      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q5x1  

       q5x1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        402        4.64        4.64
          2 |      4,284       49.41       54.05
          3 |      1,650       19.03       73.08
          4 |        132        1.52       74.60
          5 |        948       10.93       85.54
          6 |        582        6.71       92.25
          7 |         54        0.62       92.87
          8 |        222        2.56       95.43
        888 |        258        2.98       98.41
        999 |        138        1.59      100.00
------------+-----------------------------------
      Total |      8,670      100.00

-> tabulation of q5x2  

       q5x2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        678        7.82        7.82
          2 |      1,626       18.75       26.57
          3 |      2,088       24.08       50.66
          4 |      1,680       19.38       70.03
          5 |      1,236       14.26       84.29
          6 |        456        5.26       89.55
          7 |        468        5.40       94.95
        888 |        258        2.98       97.92
        999 |        180        2.08      100.00
------------+-----------------------------------
      Total |      8,670      100.00

. 
. recode q3 999 = .
(q3: 96 changes made)

. recode q4 999 = .
(q4: 24 changes made)

. recode q5 999 = .
(q5: 30 changes made)

. recode q6 999 = .
(q6: 738 changes made)

. 
. recode  q10 999 = .
(q10: 18 changes made)

. recode  q10x1 888/999 = .
(q10x1: 2766 changes made)

. recode  q10x2 888/999 = .
(q10x2: 3648 changes made)

. replace q10x2num = . if q10x2num > 700
(3684 real changes made, 3684 to missing)

. 
. tab q10 q10x1 if _mi_m ==0, m

           |              q10x1
       q10 |         1          2          . |     Total
-----------+---------------------------------+----------
         1 |       844        140          1 |       985 
         2 |         0          0        457 |       457 
         . |         0          0          3 |         3 
-----------+---------------------------------+----------
     Total |       844        140        461 |     1,445 


. 
. ** rename variables into intuitive names
. ** for better readability of outputs
. 
. gen Gender     = q1

. gen AgeShowa   = q2

. gen Education  = q3
(96 missing values generated)

. gen Residency  = q4
(24 missing values generated)

. gen Income     = q6
(738 missing values generated)

. gen NumAddress = q10x2num 
(3684 missing values generated)

. 
. 
. gen    EverWorked  = q5
(30 missing values generated)

. recode EverWorked 1/3 = 1 4 = 0
(EverWorked: 3246 changes made)

.  
. gen     AddressBook = .
(8670 missing values generated)

. replace AddressBook = 1 if q10 == 1 & q10x1 == 1
(5064 real changes made)

. replace AddressBook = 0 if q10 == 1 & q10x1 == 2
(840 real changes made)

. replace AddressBook = 0 if q10 == 2
(2742 real changes made)

. 
. tab NumAddress AddressBook if _mi_m == 0,m

           |           AddressBook
NumAddress |         0          1          . |     Total
-----------+---------------------------------+----------
         1 |         0          1          0 |         1 
         2 |         0          3          0 |         3 
         3 |         0         11          0 |        11 
         4 |         0          5          0 |         5 
         5 |         0         22          0 |        22 
         6 |         0          2          0 |         2 
         7 |         0          5          0 |         5 
         8 |         0          3          0 |         3 
         9 |         0          1          0 |         1 
        10 |         0         77          0 |        77 
        11 |         0          1          0 |         1 
        12 |         0          3          0 |         3 
        14 |         0          1          0 |         1 
        15 |         0         28          0 |        28 
        16 |         0          2          0 |         2 
        17 |         0          1          0 |         1 
        18 |         0          1          0 |         1 
        20 |         0        103          0 |       103 
        23 |         0          2          0 |         2 
        24 |         0          1          0 |         1 
        25 |         0          5          0 |         5 
        26 |         0          1          0 |         1 
        30 |         0        125          0 |       125 
        34 |         0          1          0 |         1 
        35 |         0          1          0 |         1 
        36 |         0          1          0 |         1 
        40 |         0         38          0 |        38 
        41 |         0          1          0 |         1 
        43 |         0          1          0 |         1 
        45 |         0          2          0 |         2 
        46 |         0          1          0 |         1 
        50 |         0         93          0 |        93 
        55 |         0          1          0 |         1 
        59 |         0          1          0 |         1 
        60 |         0         20          0 |        20 
        63 |         0          1          0 |         1 
        64 |         0          1          0 |         1 
        65 |         0          1          0 |         1 
        69 |         0          1          0 |         1 
        70 |         0         28          0 |        28 
        77 |         0          1          0 |         1 
        80 |         0         26          0 |        26 
        83 |         0          1          0 |         1 
        90 |         0          7          0 |         7 
       100 |         0         82          0 |        82 
       103 |         0          1          0 |         1 
       110 |         0          2          0 |         2 
       115 |         0          1          0 |         1 
       120 |         0          4          0 |         4 
       130 |         0          4          0 |         4 
       134 |         0          1          0 |         1 
       140 |         0          3          0 |         3 
       150 |         0         23          0 |        23 
       160 |         0          2          0 |         2 
       170 |         0          1          0 |         1 
       180 |         0          2          0 |         2 
       200 |         0         28          0 |        28 
       210 |         0          2          0 |         2 
       220 |         0          1          0 |         1 
       230 |         0          1          0 |         1 
       240 |         0          1          0 |         1 
       250 |         0          6          0 |         6 
       260 |         0          1          0 |         1 
       270 |         0          1          0 |         1 
       273 |         0          1          0 |         1 
       290 |         0          1          0 |         1 
       300 |         0         13          0 |        13 
       350 |         0          3          0 |         3 
       370 |         0          1          0 |         1 
       400 |         0          7          0 |         7 
       430 |         0          1          0 |         1 
       500 |         0          3          0 |         3 
       600 |         0          1          0 |         1 
       700 |         0          1          0 |         1 
         . |       597         13          4 |       614 
-----------+---------------------------------+----------
     Total |       597        844          4 |     1,445 


. 
. 
. log close
      name:  <unnamed>
       log:  /home/maida/StataBook/log/Recoding.log
  log type:  text
 closed on:  27 Jan 2013, 23:14:28
-------------------------------------------------------------------------------------------------------------------------------------
